## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.eu_web_vm.azurerm_application_gateway.app_app_gw will be created
  + resource "azurerm_application_gateway" "app_app_gw" {
      + id                          = (known after apply)
      + location                    = "westeurope"
      + name                        = "westeurope-app-gw"
      + private_endpoint_connection = (known after apply)
      + resource_group_name         = "eu-vm-app-infra-rg"

      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = []
          + name         = "app-gw-backend-pool"
        }

      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "app-gw-http-settings"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + protocol                            = "Http"
          + request_timeout                     = 60
          + trusted_root_certificate_names      = []
        }

      + frontend_ip_configuration {
          + id                            = (known after apply)
          + name                          = "app-gw-ip-config"
          + private_ip_address            = (known after apply)
          + private_ip_address_allocation = "Dynamic"
          + private_link_configuration_id = (known after apply)
          + public_ip_address_id          = (known after apply)
        }

      + frontend_port {
          + id   = (known after apply)
          + name = "app-gw-port"
          + port = 80
        }

      + gateway_ip_configuration {
          + id        = (known after apply)
          + name      = "app-gw-ip-config"
          + subnet_id = (known after apply)
        }

      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "app-gw-ip-config"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "app-gw-port"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "app-gw-http-listener"
          + protocol                       = "Http"
          + ssl_certificate_id             = (known after apply)
          + ssl_profile_id                 = (known after apply)
        }

      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "app-gw-backend-pool"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "app-gw-http-settings"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "app-gw-http-listener"
          + id                         = (known after apply)
          + name                       = "app-gw-rule"
          + priority                   = 1
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }

      + sku {
          + capacity = 2
          + name     = "Standard_v2"
          + tier     = "Standard_v2"
        }
    }

  # module.eu_web_vm.azurerm_bastion_host.vm_app_bastion will be created
  + resource "azurerm_bastion_host" "vm_app_bastion" {
      + copy_paste_enabled     = true
      + dns_name               = (known after apply)
      + file_copy_enabled      = true
      + id                     = (known after apply)
      + ip_connect_enabled     = false
      + location               = "westeurope"
      + name                   = "westeurope-bastion"
      + resource_group_name    = "eu-vm-app-infra-rg"
      + scale_units            = 2
      + shareable_link_enabled = true
      + sku                    = "Standard"
      + tunneling_enabled      = true

      + ip_configuration {
          + name                 = "bastion-ip-config"
          + public_ip_address_id = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # module.eu_web_vm.azurerm_key_vault.vm_app_vault will be created
  + resource "azurerm_key_vault" "vm_app_vault" {
      + access_policy                 = [
          + {
              + key_permissions    = [
                  + "Create",
                  + "Get",
                ]
              + object_id          = "f400cf64-30f3-4652-8279-a26aef519b32"
              + secret_permissions = [
                  + "Set",
                  + "Get",
                  + "Delete",
                  + "Purge",
                  + "Recover",
                  + "List",
                ]
              + tenant_id          = "56f16848-e5f8-4724-8e37-be5ef8afa71a"
            },
        ]
      + id                            = (known after apply)
      + location                      = "westeurope"
      + name                          = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "eu-vm-app-infra-rg"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 90
      + tenant_id                     = "56f16848-e5f8-4724-8e37-be5ef8afa71a"
      + vault_uri                     = (known after apply)
    }

  # module.eu_web_vm.azurerm_key_vault_secret.web_vm_password will be created
  + resource "azurerm_key_vault_secret" "web_vm_password" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "euweb01-vm-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.eu_web_vm.azurerm_network_interface.web_vm_nic will be created
  + resource "azurerm_network_interface" "web_vm_nic" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "westeurope"
      + mac_address                   = (known after apply)
      + name                          = "euweb01-vm-nic"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "eu-vm-app-infra-rg"
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "euweb01-vm-nic-configuration"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = (known after apply)
        }
    }

  # module.eu_web_vm.azurerm_network_interface_application_gateway_backend_address_pool_association.app_gw_nic_assoc will be created
  + resource "azurerm_network_interface_application_gateway_backend_address_pool_association" "app_gw_nic_assoc" {
      + backend_address_pool_id = (known after apply)
      + id                      = (known after apply)
      + ip_configuration_name   = "euweb01-vm-nic-configuration"
      + network_interface_id    = (known after apply)
    }

  # module.eu_web_vm.azurerm_network_security_group.web_subnet_nsg will be created
  + resource "azurerm_network_security_group" "web_subnet_nsg" {
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "web-subnet-nsg"
      + resource_group_name = "eu-vm-app-infra-rg"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "3389"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "RDP"
              + priority                                   = 1000
              + protocol                                   = "*"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "80"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "web"
              + priority                                   = 1001
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
    }

  # module.eu_web_vm.azurerm_public_ip.ag_public_ip will be created
  + resource "azurerm_public_ip" "ag_public_ip" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "westeurope"
      + name                    = "euweb01-ag-public-ip"
      + resource_group_name     = "eu-vm-app-infra-rg"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
    }

  # module.eu_web_vm.azurerm_public_ip.bastion_public_ip will be created
  + resource "azurerm_public_ip" "bastion_public_ip" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "westeurope"
      + name                    = "westeurope-bastion-ip"
      + resource_group_name     = "eu-vm-app-infra-rg"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
    }

  # module.eu_web_vm.azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = "eu-vm-app-infra-rg"
    }

  # module.eu_web_vm.azurerm_storage_account.web_storage_account will be created
  + resource "azurerm_storage_account" "web_storage_account" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "LRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = true
      + cross_tenant_replication_enabled   = true
      + default_to_oauth_authentication    = false
      + enable_https_traffic_only          = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + location                           = "westeurope"
      + min_tls_version                    = "TLS1_2"
      + name                               = (known after apply)
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "eu-vm-app-infra-rg"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
    }

  # module.eu_web_vm.azurerm_subnet.ag_gateway_subnet will be created
  + resource "azurerm_subnet" "ag_gateway_subnet" {
      + address_prefixes                               = [
          + "10.1.2.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "ag-gateway-subnet"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "eu-vm-app-infra-rg"
      + virtual_network_name                           = "westeurope-vnet"
    }

  # module.eu_web_vm.azurerm_subnet.bastion_subnet will be created
  + resource "azurerm_subnet" "bastion_subnet" {
      + address_prefixes                               = [
          + "10.1.3.0/27",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "AzureBastionSubnet"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "eu-vm-app-infra-rg"
      + virtual_network_name                           = "westeurope-vnet"
    }

  # module.eu_web_vm.azurerm_subnet.web_subnet will be created
  + resource "azurerm_subnet" "web_subnet" {
      + address_prefixes                               = [
          + "10.1.1.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "web-subnet"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "eu-vm-app-infra-rg"
      + virtual_network_name                           = "westeurope-vnet"
    }

  # module.eu_web_vm.azurerm_subnet_network_security_group_association.web_subnet_nsg_assoc will be created
  + resource "azurerm_subnet_network_security_group_association" "web_subnet_nsg_assoc" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.eu_web_vm.azurerm_virtual_machine_extension.web_server_install will be created
  + resource "azurerm_virtual_machine_extension" "web_server_install" {
      + auto_upgrade_minor_version  = true
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "euweb01-wsi"
      + publisher                   = "Microsoft.Compute"
      + settings                    = <<-EOT
            {
                  "fileUris": ["https://raw.githubusercontent.com/PacktPublishing/Practical-Azure-Infrastructure-Management/main/ch3/install-web-server.ps1"],
                  "commandToExecute": "powershell -ExecutionPolicy Unrestricted -File install-web-server.ps1 -vmName euweb01-vm"
                }
        EOT
      + type                        = "CustomScriptExtension"
      + type_handler_version        = "1.8"
      + virtual_machine_id          = (known after apply)
    }

  # module.eu_web_vm.azurerm_virtual_network.vm_app_infra_vnet will be created
  + resource "azurerm_virtual_network" "vm_app_infra_vnet" {
      + address_space       = [
          + "10.1.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "westeurope-vnet"
      + resource_group_name = "eu-vm-app-infra-rg"
      + subnet              = (known after apply)
    }

  # module.eu_web_vm.azurerm_windows_virtual_machine.web_vm will be created
  + resource "azurerm_windows_virtual_machine" "web_vm" {
      + admin_password                                         = (sensitive value)
      + admin_username                                         = "azureuser"
      + allow_extension_operations                             = true
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = (known after apply)
      + enable_automatic_updates                               = true
      + extensions_time_budget                                 = "PT1H30M"
      + hotpatching_enabled                                    = false
      + id                                                     = (known after apply)
      + location                                               = "westeurope"
      + max_bid_price                                          = -1
      + name                                                   = "euweb01-vm"
      + network_interface_ids                                  = (known after apply)
      + patch_assessment_mode                                  = "ImageDefault"
      + patch_mode                                             = "AutomaticByOS"
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = true
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "eu-vm-app-infra-rg"
      + size                                                   = "Standard_DS1_v2"
      + virtual_machine_id                                     = (known after apply)

      + boot_diagnostics {
          + storage_account_uri = (known after apply)
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = "webOsDisk"
          + storage_account_type      = "Premium_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "WindowsServer"
          + publisher = "MicrosoftWindowsServer"
          + sku       = "2022-datacenter-azure-edition"
          + version   = "latest"
        }
    }

  # module.eu_web_vm.random_id.random_id will be created
  + resource "random_id" "random_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "resource_group" = "eu-vm-app-infra-rg"
        }
    }

  # module.eu_web_vm.random_password.password will be created
  + resource "random_password" "password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 20
      + lower       = true
      + min_lower   = 1
      + min_numeric = 1
      + min_special = 1
      + min_upper   = 1
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # module.eu_web_vm.random_pet.prefix will be created
  + resource "random_pet" "prefix" {
      + id        = (known after apply)
      + length    = 1
      + prefix    = "euweb01"
      + separator = "-"
    }

  # module.global_frontdoor.azurerm_cdn_frontdoor_endpoint.fd_endpoint will be created
  + resource "azurerm_cdn_frontdoor_endpoint" "fd_endpoint" {
      + cdn_frontdoor_profile_id = (known after apply)
      + enabled                  = true
      + host_name                = (known after apply)
      + id                       = (known after apply)
      + name                     = "app-vm-fd-ep"
    }

  # module.global_frontdoor.azurerm_cdn_frontdoor_origin.eu_ag_origin will be created
  + resource "azurerm_cdn_frontdoor_origin" "eu_ag_origin" {
      + cdn_frontdoor_origin_group_id  = (known after apply)
      + certificate_name_check_enabled = false
      + enabled                        = true
      + health_probes_enabled          = (known after apply)
      + host_name                      = (known after apply)
      + http_port                      = 80
      + https_port                     = 443
      + id                             = (known after apply)
      + name                           = "eu-ag-origin"
      + priority                       = 1
      + weight                         = 1
    }

  # module.global_frontdoor.azurerm_cdn_frontdoor_origin.na_ag_origin will be created
  + resource "azurerm_cdn_frontdoor_origin" "na_ag_origin" {
      + cdn_frontdoor_origin_group_id  = (known after apply)
      + certificate_name_check_enabled = false
      + enabled                        = true
      + health_probes_enabled          = (known after apply)
      + host_name                      = (known after apply)
      + http_port                      = 80
      + https_port                     = 443
      + id                             = (known after apply)
      + name                           = "na-ag-origin"
      + priority                       = 1
      + weight                         = 1
    }

  # module.global_frontdoor.azurerm_cdn_frontdoor_origin_group.vm_app_origin_group will be created
  + resource "azurerm_cdn_frontdoor_origin_group" "vm_app_origin_group" {
      + cdn_frontdoor_profile_id                                  = (known after apply)
      + id                                                        = (known after apply)
      + name                                                      = "app-origin-group"
      + restore_traffic_time_to_healed_or_new_endpoint_in_minutes = 10
      + session_affinity_enabled                                  = false

      + health_probe {
          + interval_in_seconds = 240
          + path                = "/healthProbe"
          + protocol            = "Http"
          + request_type        = "HEAD"
        }

      + load_balancing {
          + additional_latency_in_milliseconds = 0
          + sample_size                        = 16
          + successful_samples_required        = 3
        }
    }

  # module.global_frontdoor.azurerm_cdn_frontdoor_profile.vm_app_fd_profile will be created
  + resource "azurerm_cdn_frontdoor_profile" "vm_app_fd_profile" {
      + id                       = (known after apply)
      + name                     = "vm-app-afd-profile"
      + resource_group_name      = "central-services-rg"
      + resource_guid            = (known after apply)
      + response_timeout_seconds = 120
      + sku_name                 = "Standard_AzureFrontDoor"
    }

  # module.global_frontdoor.azurerm_cdn_frontdoor_route.fd_route will be created
  + resource "azurerm_cdn_frontdoor_route" "fd_route" {
      + cdn_frontdoor_endpoint_id     = (known after apply)
      + cdn_frontdoor_origin_group_id = (known after apply)
      + cdn_frontdoor_origin_ids      = (known after apply)
      + cdn_frontdoor_rule_set_ids    = (known after apply)
      + enabled                       = true
      + forwarding_protocol           = "MatchRequest"
      + https_redirect_enabled        = false
      + id                            = (known after apply)
      + link_to_default_domain        = true
      + name                          = "app-vm-fd-route"
      + patterns_to_match             = [
          + "/*",
        ]
      + supported_protocols           = [
          + "Http",
        ]

      + cache {
          + compression_enabled           = true
          + content_types_to_compress     = [
              + "text/html",
              + "text/javascript",
              + "text/xml",
            ]
          + query_string_caching_behavior = "IgnoreSpecifiedQueryStrings"
          + query_strings                 = [
              + "account",
              + "settings",
            ]
        }
    }

  # module.global_frontdoor.azurerm_cdn_frontdoor_rule_set.fd_rule_set will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "fd_rule_set" {
      + cdn_frontdoor_profile_id = (known after apply)
      + id                       = (known after apply)
      + name                     = "AppVMRuleSet"
    }

  # module.global_frontdoor.azurerm_resource_group.central_rg will be created
  + resource "azurerm_resource_group" "central_rg" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = "central-services-rg"
    }

  # module.na_web_vm.azurerm_application_gateway.app_app_gw will be created
  + resource "azurerm_application_gateway" "app_app_gw" {
      + id                          = (known after apply)
      + location                    = "eastus"
      + name                        = "eastus-app-gw"
      + private_endpoint_connection = (known after apply)
      + resource_group_name         = "na-vm-app-infra-rg"

      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = []
          + name         = "app-gw-backend-pool"
        }

      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "app-gw-http-settings"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + protocol                            = "Http"
          + request_timeout                     = 60
          + trusted_root_certificate_names      = []
        }

      + frontend_ip_configuration {
          + id                            = (known after apply)
          + name                          = "app-gw-ip-config"
          + private_ip_address            = (known after apply)
          + private_ip_address_allocation = "Dynamic"
          + private_link_configuration_id = (known after apply)
          + public_ip_address_id          = (known after apply)
        }

      + frontend_port {
          + id   = (known after apply)
          + name = "app-gw-port"
          + port = 80
        }

      + gateway_ip_configuration {
          + id        = (known after apply)
          + name      = "app-gw-ip-config"
          + subnet_id = (known after apply)
        }

      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "app-gw-ip-config"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "app-gw-port"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "app-gw-http-listener"
          + protocol                       = "Http"
          + ssl_certificate_id             = (known after apply)
          + ssl_profile_id                 = (known after apply)
        }

      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "app-gw-backend-pool"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "app-gw-http-settings"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "app-gw-http-listener"
          + id                         = (known after apply)
          + name                       = "app-gw-rule"
          + priority                   = 1
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }

      + sku {
          + capacity = 2
          + name     = "Standard_v2"
          + tier     = "Standard_v2"
        }
    }

  # module.na_web_vm.azurerm_bastion_host.vm_app_bastion will be created
  + resource "azurerm_bastion_host" "vm_app_bastion" {
      + copy_paste_enabled     = true
      + dns_name               = (known after apply)
      + file_copy_enabled      = true
      + id                     = (known after apply)
      + ip_connect_enabled     = false
      + location               = "eastus"
      + name                   = "eastus-bastion"
      + resource_group_name    = "na-vm-app-infra-rg"
      + scale_units            = 2
      + shareable_link_enabled = true
      + sku                    = "Standard"
      + tunneling_enabled      = true

      + ip_configuration {
          + name                 = "bastion-ip-config"
          + public_ip_address_id = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # module.na_web_vm.azurerm_key_vault.vm_app_vault will be created
  + resource "azurerm_key_vault" "vm_app_vault" {
      + access_policy                 = [
          + {
              + key_permissions    = [
                  + "Create",
                  + "Get",
                ]
              + object_id          = "f400cf64-30f3-4652-8279-a26aef519b32"
              + secret_permissions = [
                  + "Set",
                  + "Get",
                  + "Delete",
                  + "Purge",
                  + "Recover",
                  + "List",
                ]
              + tenant_id          = "56f16848-e5f8-4724-8e37-be5ef8afa71a"
            },
        ]
      + id                            = (known after apply)
      + location                      = "eastus"
      + name                          = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "na-vm-app-infra-rg"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 90
      + tenant_id                     = "56f16848-e5f8-4724-8e37-be5ef8afa71a"
      + vault_uri                     = (known after apply)
    }

  # module.na_web_vm.azurerm_key_vault_secret.web_vm_password will be created
  + resource "azurerm_key_vault_secret" "web_vm_password" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "naweb01-vm-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.na_web_vm.azurerm_network_interface.web_vm_nic will be created
  + resource "azurerm_network_interface" "web_vm_nic" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "eastus"
      + mac_address                   = (known after apply)
      + name                          = "naweb01-vm-nic"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "na-vm-app-infra-rg"
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "naweb01-vm-nic-configuration"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = (known after apply)
        }
    }

  # module.na_web_vm.azurerm_network_interface_application_gateway_backend_address_pool_association.app_gw_nic_assoc will be created
  + resource "azurerm_network_interface_application_gateway_backend_address_pool_association" "app_gw_nic_assoc" {
      + backend_address_pool_id = (known after apply)
      + id                      = (known after apply)
      + ip_configuration_name   = "naweb01-vm-nic-configuration"
      + network_interface_id    = (known after apply)
    }

  # module.na_web_vm.azurerm_network_security_group.web_subnet_nsg will be created
  + resource "azurerm_network_security_group" "web_subnet_nsg" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "web-subnet-nsg"
      + resource_group_name = "na-vm-app-infra-rg"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "3389"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "RDP"
              + priority                                   = 1000
              + protocol                                   = "*"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "80"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "web"
              + priority                                   = 1001
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
    }

  # module.na_web_vm.azurerm_public_ip.ag_public_ip will be created
  + resource "azurerm_public_ip" "ag_public_ip" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "eastus"
      + name                    = "naweb01-ag-public-ip"
      + resource_group_name     = "na-vm-app-infra-rg"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
    }

  # module.na_web_vm.azurerm_public_ip.bastion_public_ip will be created
  + resource "azurerm_public_ip" "bastion_public_ip" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "eastus"
      + name                    = "eastus-bastion-ip"
      + resource_group_name     = "na-vm-app-infra-rg"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
    }

  # module.na_web_vm.azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "na-vm-app-infra-rg"
    }

  # module.na_web_vm.azurerm_storage_account.web_storage_account will be created
  + resource "azurerm_storage_account" "web_storage_account" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "LRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = true
      + cross_tenant_replication_enabled   = true
      + default_to_oauth_authentication    = false
      + enable_https_traffic_only          = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + location                           = "eastus"
      + min_tls_version                    = "TLS1_2"
      + name                               = (known after apply)
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "na-vm-app-infra-rg"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
    }

  # module.na_web_vm.azurerm_subnet.ag_gateway_subnet will be created
  + resource "azurerm_subnet" "ag_gateway_subnet" {
      + address_prefixes                               = [
          + "10.2.2.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "ag-gateway-subnet"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "na-vm-app-infra-rg"
      + virtual_network_name                           = "eastus-vnet"
    }

  # module.na_web_vm.azurerm_subnet.bastion_subnet will be created
  + resource "azurerm_subnet" "bastion_subnet" {
      + address_prefixes                               = [
          + "10.2.3.0/27",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "AzureBastionSubnet"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "na-vm-app-infra-rg"
      + virtual_network_name                           = "eastus-vnet"
    }

  # module.na_web_vm.azurerm_subnet.web_subnet will be created
  + resource "azurerm_subnet" "web_subnet" {
      + address_prefixes                               = [
          + "10.2.1.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "web-subnet"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "na-vm-app-infra-rg"
      + virtual_network_name                           = "eastus-vnet"
    }

  # module.na_web_vm.azurerm_subnet_network_security_group_association.web_subnet_nsg_assoc will be created
  + resource "azurerm_subnet_network_security_group_association" "web_subnet_nsg_assoc" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.na_web_vm.azurerm_virtual_machine_extension.web_server_install will be created
  + resource "azurerm_virtual_machine_extension" "web_server_install" {
      + auto_upgrade_minor_version  = true
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "naweb01-wsi"
      + publisher                   = "Microsoft.Compute"
      + settings                    = <<-EOT
            {
                  "fileUris": ["https://raw.githubusercontent.com/PacktPublishing/Practical-Azure-Infrastructure-Management/main/ch3/install-web-server.ps1"],
                  "commandToExecute": "powershell -ExecutionPolicy Unrestricted -File install-web-server.ps1 -vmName naweb01-vm"
                }
        EOT
      + type                        = "CustomScriptExtension"
      + type_handler_version        = "1.8"
      + virtual_machine_id          = (known after apply)
    }

  # module.na_web_vm.azurerm_virtual_network.vm_app_infra_vnet will be created
  + resource "azurerm_virtual_network" "vm_app_infra_vnet" {
      + address_space       = [
          + "10.2.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "eastus-vnet"
      + resource_group_name = "na-vm-app-infra-rg"
      + subnet              = (known after apply)
    }

  # module.na_web_vm.azurerm_windows_virtual_machine.web_vm will be created
  + resource "azurerm_windows_virtual_machine" "web_vm" {
      + admin_password                                         = (sensitive value)
      + admin_username                                         = "azureuser"
      + allow_extension_operations                             = true
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = (known after apply)
      + enable_automatic_updates                               = true
      + extensions_time_budget                                 = "PT1H30M"
      + hotpatching_enabled                                    = false
      + id                                                     = (known after apply)
      + location                                               = "eastus"
      + max_bid_price                                          = -1
      + name                                                   = "naweb01-vm"
      + network_interface_ids                                  = (known after apply)
      + patch_assessment_mode                                  = "ImageDefault"
      + patch_mode                                             = "AutomaticByOS"
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = true
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "na-vm-app-infra-rg"
      + size                                                   = "Standard_DS1_v2"
      + virtual_machine_id                                     = (known after apply)

      + boot_diagnostics {
          + storage_account_uri = (known after apply)
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = "webOsDisk"
          + storage_account_type      = "Premium_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "WindowsServer"
          + publisher = "MicrosoftWindowsServer"
          + sku       = "2022-datacenter-azure-edition"
          + version   = "latest"
        }
    }

  # module.na_web_vm.random_id.random_id will be created
  + resource "random_id" "random_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "resource_group" = "na-vm-app-infra-rg"
        }
    }

  # module.na_web_vm.random_password.password will be created
  + resource "random_password" "password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 20
      + lower       = true
      + min_lower   = 1
      + min_numeric = 1
      + min_special = 1
      + min_upper   = 1
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # module.na_web_vm.random_pet.prefix will be created
  + resource "random_pet" "prefix" {
      + id        = (known after apply)
      + length    = 1
      + prefix    = "naweb01"
      + separator = "-"
    }

Plan: 50 to add, 0 to change, 0 to destroy.
```
</details>